Autodesk.Revit.DB.ParameterFilterElement.GetElementFilterParametersForCategory(Autodesk.Revit.DB.ElementId)
Retrieves a list of the parameters associated with all rules in the filter
that are combined (using logical AND) with a FilterCategoryRule corresponding to single %categoryId%.
Remarks:
Note that in the case when InvalidElementId specified as input %categoryId% this function returns
parameters common to all categories used by this ParameterFilterElement,
i.e. it is equivalent to ParameterFilterElement.GetElementFilterParameters().
categoryId:
The category for which parameters should be found.
Returns:
A set of parameter identifiers.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ParameterFilterElement.ElementFilterIsAcceptableForParameterFilterElement(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementFilter)
Checks that an ElementFilter is acceptable for use in defining the filtering rules
for a given list of categories (i.e., for view filtering).
Remarks:
ElementFilter is either an ElementParameterFilter or an ElementLogicalFilter
representing a Boolean combination of ElementParameterFilters. In addition, we check that
each ElementParameterFilter satisfies the following conditions:
Its array of FilterRules is not empty and contains:
Any number of FilterRules of type FilterValueRule, FilterInverseRule, and SharedParameterApplicableRule or Exactly one FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement or Exactly two rules: the first one is a FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement and
the second one is a FilterRule of type FilterValueRule, FilterInverseRule, or SharedParameterApplicableRule.
Note that cases in the second and third bullet are currently allowed only if the parent node of ElementParameterFilter is LogicalOrFilter.
aDocument:
The document in which to create the ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
elementFilter:
The ElementFilter to validate.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.ElementFilterIsAcceptableForParameterFilterElement(Autodesk.Revit.DB.ElementFilter)
Checks that an ElementFilter is acceptable for use in defining the filtering rules
for a ParameterFilterElement (i.e., for view filtering).
Remarks:
ElementFilter is either an ElementParameterFilter or an ElementLogicalFilter
representing a Boolean combination of ElementParameterFilters. In addition, we check that
each ElementParameterFilter satisfies the following conditions:
Its array of FilterRules is not empty and contains:
Any number of FilterRules of type FilterValueRule, FilterInverseRule, and SharedParameterApplicableRule or Exactly one FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement or Exactly two rules: the first one is a FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement and
the second one is a FilterRule of type FilterValueRule, FilterInverseRule, or SharedParameterApplicableRule.
Note that cases in the second and third bullet are currently allowed only if the parent node of ElementParameterFilter is LogicalOrFilter.
elementFilter:
The ElementFilter to validate.
Returns:
True if the ElementFilter is acceptable for use by an ParameterFilterElement, false if not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementFilter)
Creates a new ParameterFilterElement in the given document.
aDocument:
The document in which to create the ParameterFilterElement.
name:
The user-visible name for the new ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
elementFilter:
The rules for the new ParameterFilterElement, represented as an ElementFilter.
ElementFilter is either an ElementParameterFilter or an ElementLogicalFilter
representing a Boolean combination of ElementParameterFilters. In addition, we check that
each ElementParameterFilter satisfies the following conditions:
Its array of FilterRules is not empty and contains:
Any number of FilterRules of type FilterValueRule, FilterInverseRule, and SharedParameterApplicableRule or Exactly one FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement or Exactly two rules: the first one is a FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement and
the second one is a FilterRule of type FilterValueRule, FilterInverseRule, or SharedParameterApplicableRule.
Note that cases in the second and third bullet are currently allowed only if the parent node of ElementParameterFilter is LogicalOrFilter.
Returns:
A pointer to the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a filter element name.
-or-
One of the given rules refers to a parameter that does not apply to this filter's categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The ElementFilter is not acceptable for use by a ParameterFilterElement.
Since:
2019